src/main/resources/examples/TrackOrder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tsh="http://acme.com/tshirt-service">
   <soapenv:Header/>
   <soapenv:Body>
      <tsh:TrackOrder>
         <orderId>100</orderId>
      </tsh:TrackOrder>
   </soapenv:Body>
</soapenv:Envelope>